In [1]:
import pandas as pd

C:\Users\Waris Hayyat\AppData\Local\Temp\ipykernel_15140\1915490065.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [4]:
l=[12,1,314,15,15,6,6,7,8,0,0,10,12,13,14,14]
var=pd.DataFrame(l)
var

      0
0    12
1     1
2   314
3    15
4    15
5     6
6     6
7     7
8     8
9     0
10    0
11   10
12   12
13   13
14   14
15   14

In [5]:
list2=[pd.Series(["aman","Ashir","Arham","Tabish","Rafay","Sanan"]),pd.Series(["Hashim","mohin","Akash","yash","Saalar","rafii"])]
var2=pd.DataFrame(list2)
var2

        0      1      2       3       4      5
0    aman  Ashir  Arham  Tabish   Rafay  Sanan
1  Hashim  mohin  Akash    yash  Saalar  rafii

In [8]:
dic={
    "waris":["Data Scientist","Google","320000$","Deep learning"],
    "Bilal":["Software-Engineering","Google","310000$","Bckened"],
    "Numan":["Graphic designer","Google","32000$","Figma"],
    "Tabii":["Quallity tester","Google","32000$","Automatic"]
}
var4=pd.DataFrame(dic)
var4

            waris                 Bilal             Numan            Tabii
0  Data Scientist  Software-Engineering  Graphic designer  Quallity tester
1          Google                Google            Google           Google
2         320000$               310000$            32000$           32000$
3   Deep learning               Bckened             Figma        Automatic

In [13]:
list4=[[1,2,3,4,5,6,"Google"],[1,2,3,4,5,6,"Microsoft"],[1,2,3,4,5,6,"Amazon"],[1,2,3,4,5,6,"Apple"]]
var5=pd.DataFrame(list4)
var5

   0  1  2  3  4  5          6
0  1  2  3  4  5  6     Google
1  1  2  3  4  5  6  Microsoft
2  1  2  3  4  5  6     Amazon
3  1  2  3  4  5  6      Apple

In [14]:
dic={
    "waris":["Data Scientist","Google","320000$","Deep learning"],
    "Bilal":["Software-Engineering","Google","310000$","Bckened"],
    "Numan":["Graphic designer","Google","32000$","Figma"],
    "Tabii":["Quallity tester","Google","32000$","Automatic"]
}
var4=pd.DataFrame(dic,columns=["waris","Tabii"])
var4

            waris            Tabii
0  Data Scientist  Quallity tester
1          Google           Google
2         320000$           32000$
3   Deep learning        Automatic

In [15]:
print(var4["waris"][2])

320000$

In [16]:
print(var4["Tabii"][3])

Automatic

In [17]:
print(var4["waris"][3])

Deep learning